Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/unfair_commercial_practices.html.txt.tmx
Source language: en
Languages: ga

source: • Practices which are always banned
ga: • Cleachtais a mbíonn cosc orthu i gcónaí

source: The EU Unfair Commercial Practices Directive (Directive 2005/28/EC of 11 May 2005) (pdf) deals with unfair business-to-consumer commercial practices (it does not apply to dealings between businesses)
ga: Baineann Treoir an AE i leith Cleachtas Tráchtála Éagórach (Treoir 2005/28/CE an 11 Bealtaine 2005) le cleachtais tráchtála gnó-go-tomhaltóir éagóracha (ní bhaineann sé le gnó idir gnóthaí)

source: The Consumer Protection Act 2007 which was brought into effect in May 2007 provides for its implementation in Ireland
ga: Forálann an tAcht um Chosaint Tomhaltóirí 2007, a tháinig i bhfeidhm i mBealtaine 2007, dá forfheidhmiú in Éirinn

source: All parts of the Act have been implemented (apart from Sections 48 and 49 which deal with surcharges on certain payment methods – see below)
ga: Tá gach cuid den Acht curtha i bhfeidhm (lasmuigh d'Ailt 48 agus 49 a bhaineann le formhuirir ar mhodhanna áirithe íocaíochta – féach thíos)

source: The Act provides that a range of unfair, misleading and aggressive trading practices are banned if they are likely to cause appreciable impairment of your ability to make an informed choice in relation to the product concerned and cause you to make a decision about a transaction you would not otherwise make
ga: Forálann an tAcht go gcuirtear cosc ar raon de chleachtais trádála éagóracha, mhíthreoracha agus fhóbartacha más cosúil go laghdóidís go mór do chumas rogha eolasach a dhéanamh maidir leis an táirge atá i gceist agus go ndéanfá cinneadh faoi idirbheart dá mbarr nach ndéanfá murach iad

source: These practices are banned if they meet two conditions:
ga: Cuirtear cosc ar na cleachtais seo má chomhlíonann siad dhá choinníoll:

source: They are unfair, misleading or aggressive
ga: Tá siad éagórach, míthreorach nó fóbartach

source: They are likely to distort your consumer choice
ga: D'fhéadfadh siad do rogha mar thomhaltóir a riocht

source: The legislation also provides that certain practices are always banned - these do not have to meet the second condition
ga: Forálann an reachtaíocht seo go gcuirtear cosc ar chleachtais áirithe i gcónaí - ní chaithfidh na cleachtais seo an dara coinníoll a chomhlíonadh

source: Information on unfair commercial practices is available under an EU initiative at http://www.isitfair.eu/
ga: Tugadh an fhreagracht don Ghníomhaireacht Náisiúnta Tomhaltóirí chun forálacha na reachtaíochta a fhorfheidhmiú

source: The Central Bank of Ireland also has a role in enforcing the provisions in the financial services area
ga: Tá ról ag an Bhainc Ceannais na hÉireann freisin i bhforálacha a fhorfheidhmiú i réimse na seirbhísí airgeadais

source: There is more information on enforcement here
ga: Tá tuilleadh eolais le fáil anseo maidir le forfheidhmiú

source: A commercial practice is considered to be unfair if it is contrary to the requirements of professional diligence
ga: Meastar go bhfuil cleachtas tráchtála éagórach má thagann sé salach ar riachtanais na dúthrachta gairmiúla

source: That means it is contrary to the general principle of good faith in the trader's field of activity and/or the standard of skill and care that the trader could reasonably be expected to exercise towards consumers
ga: Is éard is brí leis seo ná go dtagann sé salach ar phrionsabal ginearálta an dea-rúin i réimse gníomhaíochta an trádálaí agus/nó ar chaighdeán na hoilteachta agus an chúraim ar féidir a bheith ag súil go gcuirfeadh an trádálaí ar fáil do thomhaltóirí

source: Existing consumer legislation already prohibited some misleading commercial practices, for example, misleading advertisements
ga: Chuir reachtaíocht tomhaltóirí an bhí ann cheana féin cosc ar roinnt cleachtais tráchtála mhíthreoracha, mar shampla fógraí míthreoracha

source: This Act, however, provides for a more extensive list of prohibited practices
ga: Forálann an tAcht seo do liosta níos cuimsithí de chleachtais choiscthe

source: The sale of property was not covered by existing legislation but is included in the scope of this Act
ga: Níor chlúdaigh an reachtaíocht roimhe maoin a dhíol ach tá sé clúdaithe faoi scóip an Achta seo

source: The Minister has the power to make Regulations prescribing the sort of information which must be provided with specific products and with specific advertising
ga: Tá sé de chumhacht ag an Aire Rialacháin a dhéanamh a leagann síos an cineál eolais a gcaithfear a chur ar fáil le táirgí sainiúla agus le fógraíocht shainiúil

source: The Act provides that certain practices in relation to
ga: Forálann an tAcht go bhfuil cleachtais áirithe maidir le:

source: More detailed information on these specific practices is set out below:
ga: Leagtar amach tuilleadh eolais maidir leis na cleachtais shainiúla seo thíos:

source: A commercial practice is misleading if it includes providing false information about or, would cause you to be deceived about:
ga: Tá cleachtas tráchtála míthreorach má chuireann sé eolas bréagach ar fáil, nó dá gcuirfeadh sé faoi deara duit a bheith meallta maidir le ceann de na nithe seo a leanas:

source: • The existence or nature of a product and its main characteristics
ga: • Marthain nó nádúr táirge agus a phríomhthréithe

source: • The need for any part, replacement, servicing or repair
ga: • An gá le haon chomhpháirt, athchur, seirbhísiú nó deisiú

source: • The existence, extent or nature of any approval or sponsorship (direct or indirect) of the product by others
ga: • Marthain, méid nó nádúr aon fhaomhadh nó urraíocht (díreach nó indíreach) an táirge le haonáin eile

source: • The nature, attributes or rights of the trader
ga: • Nádúr, tréithe nó cearta an trádálaí

source: • The extent of the trader's commitments
ga: • Méid ghealltanais an trádálaí

source: • The trader's motives for the commercial practice
ga: • Ceannfháthanna an trádálaí don chleachtas trádálaí

source: • The nature of the trader's supply process
ga: • Nádúr phróiseas soláthair an trádálaí

source: The Act gives the Minister the power to make Regulations that require some products to carry specified information
ga: Tugann an tAcht an chumhacht don Aire Rialacháin a dhéanamh a éilíonn go dtugtar eolas sonraithe le táirgí áirithe

source: A commercial practice involving marketing or advertising is misleading if it causes the average person to confuse a competitor's product with the trader's product or a competitor's trade name or trademark, or some other distinguishing feature or mark, with that of the trader
ga: Tá cleachtas tráchtála a bhaineann le margaíocht nó fógraíocht míthreorach má chuireann sé faoi deara don ghnáthdhuine a cheapadh gurb ionann táirge iomaitheora agus táirge an trádálaí, nó gurb ionann ainm trádála nó trádmharc nó gné nó marc ar leith eile agus marc an trádálaí

source: A commercial practice is misleading if it involves a representation that the trader abides or is bound by a code of practice and the trader fails to comply with a firm commitment in that code of practice
ga: Tá cleachtas tráchtála míthreorach má thugann sé le fios go gcloíonn an trádálaí le cód cleachtais nó go bhfuil sé ceangailte aige, agus go dteipeann ar an trádálaí cloí le tiomantas daingean sa chód cleachtais sin

source: A commercial practices is misleading if the trader omits or conceals material information that the average consumer would need in order to make an informed decision
ga: Tá cleachtas tráchtála míthreorach má fhágann trádálaí eolas tábhachtach ar lár, nó má cheileann sé é, a theastódh ón ngnáth-thomhaltóir le cinneadh eolasach a dhéanamh

source: A commercial practice is misleading if the trader provides material information in a manner that is unclear, unintelligible, ambiguous or untimely, or fails to identify the commercial intent of the practice
ga: Tá cleachtas tráchtála míthreorach má chuireann trádálaí eolas tábhachtach ar fáil i mbealach atá doiléir, débhríoch nó míthráthúil, nó mura n-aithníonn sé cuspóir tráchtála an chleachtais

source: The Act outlaws the practice of charging consumers more for using different methods of payment
ga: Cuireann an tAcht cosc ar an gcleachtas de chostas níos airde a ghearradh ar chustaiméirí de bharr modhanna íocaíochta éagsúla

source: Traders who are prepared to accept payment by two or more of the following:
ga: Níl sé de chead ag trádálaithe atá sásta glacadh le híocaíochtaí le dhá mhodh de na modhanna seo a leanas:

source: • Any other prescribed method
ga: • Aon mhodh ordaithe eile

source: may not charge the consumer more for using one such method
ga: costas níos airde a ghearradh ar thomhaltóirí as modh amháin de na modhanna seo a úsáid

source: So, for example, if it is possible to pay for goods in cash or by credit card, you cannot be charged more for paying by credit card
ga: Dá réir sin, mar shampla, más féidir íoc as earraí le hairgead tirim nó le cárta creidmheasa, ní féidir costas níos airde a ghearradh ort as cárta creidmheasa a úsáid

source: It will continue to be legal to impose a charge for payment by credit card if there is no alternative method of payment or if the charge applies to all methods of payment, but the price quoted must include such a charge
ga: Beidh sé dlíthiúil i gcónaí táille a ghearradh ar íocaíocht le cárta creidmheasa mura bhfuil aon mhodh íocaíochta eile ann nó má bhaineann an táille le gach modh íocaíochta, ach caithfidh go gcuimsíonn an praghas a luaitear táille dá leithéid

source: The sections on payment methods were not implemented in May 2007 with the rest of the Act
ga: Níor forghníomhaíodh na hailt maidir le modhanna íocaíochta i mBealtaine 2007 leis an gcuid eile den Acht

source: Aggressive commercial practices are defined as practices involving harassment, coercion or undue influence that impair your freedom of choice and affect your purchasing decisions
ga: Is cleachtais fhóbartacha iad cleachtais a mbaineann ciapadh, comhéigean nó tionchar míchuí leo a chuireann isteach ar do saor-rogha agus a chuireann as do do chinntí ceannaigh

source: The Act sets out some examples of aggressive practices (but the list is not exhaustive)
ga: Leagann an tAcht amach roinnt samplaí de chleachtais fhóbartacha (ach ní liosta cuimsitheach atá ann)

source: Aggressive commercial practices include:
ga: Airítear ar chleachtais tráchtála fhóbartacha:

source: • Sales tactics that try to intimidate or coerce consumers
ga: • Oirbheartaíocht díolacháin a dhéanann iarracht tomhaltóirí a imeaglú nó a comhéigniú

source: • The use of threatening or abusive behaviour
ga: • A bheith bagrach nó mí-úsáid a bhaint as an gcustaiméir

source: • Practices that try to take advantage of vulnerable consumers
ga: • Cleachtais a fhéachann le leas a bhaint as custaiméirí leochaileacha

source: (A vulnerable consumer is one whom the trader could foresee as vulnerable because of mental or physical infirmity, age or credulity.)
ga: (Is éard is custaiméir leochaileach ann ná custaiméir a mbeadh an trádálaí in ann a aithint roimh ré go bhfuil sé/sí leochaileach toisc éiglíocht aigne nó choirp nó toisc é a bheith éasca dallamullóg a chur air/uirthi.)

source: • The imposition of onerous or disproportionate non-contractual barriers by the trader when the consumer wishes to end the contract or exercise a contractual right, or switch to another product or trader
ga: • Go gcuirfeadh an trádálaí baic neamhchonartha dhochaidreacha nó dhíréireacha i bhfeidhm nuair is mian leis an gcustaiméir deireadh a chur leis an gconradh nó feidhm a bhaint as ceart conartha, nó aistriú go dtí táirge nó trádálaí eile

source: • Threats to take legal action when the trader has no basis for such action
ga: • Bagairtí go gcuirfear an dlí ar dhuine nuair nach bhfuil aon bhunús ag an trádálaí lena leithéid a dhéanamh

source: Practices which are always banned
ga: Cleachtais a mbíonn cosc orthu i gcónaí

source: The Act provides that certain commercial practices are always banned, whether or not they would affect a consumer's decision
ga: • Éilimh bhréagacha go bhfuil sé dleathach táirge a sholáthar • Éilimh bhréagacha gur féidir le táirgí tinnis a leigheas
